Revit 2027 API
FabricationPartBrowserChangedEventArgs.ServiceId Property
 The identifier for the fabrication service.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceId { get; }
Public ReadOnly Property ServiceId As Integer
	Get
public:
property int ServiceId {
	int get ();
}
member ServiceId : int with get
Property Value
Int32
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace